[Comparer deux tableaux Excel par formule Python](https://www.youtube.com/watch?v=Dldd0KhFzsk&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=17)

Date : 15/05/2025

In [1]:
import pandas as pd

In [14]:
tb1 = pd.read_excel(
    'data/Compare.xlsx', 
    sheet_name='Feuil1',
    )

In [15]:
tb1.head()

             Nom    Prénom
0        Bonbeur      Jean
1        Hèresse    Mégane
2           Noix  Stéphane
3         Gature    Emilie
4  De MontéCarlo   Coralie

In [16]:
tb2 = pd.read_excel(
    'data/Compare.xlsx', 
    sheet_name='Feuil2',
    )

In [9]:
tb2.head()

           Nom.1  Prénom.1
0        Bonbeur      Jean
1        Hèresse    Mégane
2           Noix  Stéphane
3         Gature    Emilie
4  De MontéCarlo   Coralie

In [17]:
tb1.compare(tb2)

         Nom             Prénom
        self     other     self     other
6   Sansasse  ocerosse   Lionel  severine
7      Thine     louya    Nikos       ali
8       Solo    Douche    Yohan      Raël
9        Jet  Sarbaque   Claire      Anne
10   Braltar      Lile    Giles   Maurice
11    Douche     Doeuf     Raël      John
12  Sarbaque    Niomme     Anne    Gérard
13      Lile   feuille  Maurice    emille
14     Doeuf   fortune     John     alain
15    Niomme      Solo   Gérard     Yohan
16   Honnête       Jet  Camille    Claire
17   Tomette   Braltar    Jerry     Giles